#Задание 1
#Пользователь вводит с клавиатуры время в секуyдах, прошедшее с начала дня. В зависимости от выбора
#пользователя посчитать, сколько часов, минут и секунд
#осталось до полуночи
userSec = 84600 - int(input(" Введите время в секундах:"))
hours = seconds // 3600
seconds -= 3600 * hours
minutes = seconds // 60
a =
if a == 1:
    print(result/3600)
elif userSec == 2:
    print(result/60)
if userSec == 3:
    print == 3

result = userSec - 84600
